In [9]:
# Mereging two and more than two dataframes
import pandas as pd
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
var2 = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
pd.merge(var1,var2)
# Merge fun is used to merge the dataframes.
# It takes dataframes name as an argument and the condition on which you are merging the data.
pd.merge(var1,var2, on = 'A')
# We can use single quote and double quote as well.

   A  B_x  B_y
0  1    5    5
1  2    6    6
2  3    7    7
3  4    8    8

In [8]:
import pandas as pd
var = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
# var["Value"] = var["A"] <= var["B"]
var["Value"] = var["A"] < 4
var

   A  B  Value
0  1  5   True
1  2  6   True
2  3  7   True
3  4  8  False

In [7]:
import pandas as pd
var = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
var["C"] = var["A"]+var["B"]
# This is line add a new column to dataframe.
# Performs the add operation on A and B
# We can perform add, subtract, multiply and divide operation as well.
print(var)
var
# This is the designated form of dataframe

   A  B   C
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12

   A  B   C
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12

In [6]:
import pandas as pd
var = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
print(var)
print()

# We can individual access the value of each key
print(var["A"])
print()
print(var["B"])

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

0    1
1    2
2    3
3    4
Name: A, dtype: int64

0    5
1    6
2    7
3    8
Name: B, dtype: int64

In [5]:
import pandas as pd
sr = {"s":pd.Series([1,2,3,4]),"r":pd.Series([5,6,7,8])}
var = pd.DataFrame(sr)
print(var)

   s  r
0  1  5
1  2  6
2  3  7
3  4  8

In [4]:
import pandas as pd
list1 = [[1,2,3,4],[5,6,7,8]]
var2  = pd.DataFrame(list1)
print(var2)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [3]:
import pandas as pd
s1 = pd.Series(12, index = [1,2,3,4])
s2 = pd.Series(13, index = [1,2,3,4])
print(s1+s2)

1    25
2    25
3    25
4    25
dtype: int64

In [1]:
# insert the column, delete the column, pop the column
import pandas as pd 
var = pd.DataFrame({"A":[1,2,3,4],"B":[9,8,7,6]})
var

   A  B
0  1  9
1  2  8
2  3  7
3  4  6

In [1]:
# how to do slicing in pandas 
import pandas as pd 
var = pd.DataFrame({"A":[1,2,3,4],"B":[9,8,7,6]})
var["ml"] = var["A"] 
var

   A  B  ml
0  1  9   1
1  2  8   2
2  3  7   3
3  4  6   4

In [2]:
import pandas as pd
s1 = pd.Series(12, index = [1,2,3,4])
print(s1)

1    12
2    12
3    12
4    12
dtype: int64

In [1]:
print("hello World")

hello World